import React from 'react';
import styles from './InformationBlock.module.scss';

export const InformationBlock = React.memo(() => {
  return (
    <div className={styles.infoBlock}>
      <div className={styles.infoContainer}>
        <div className={styles.info}>
          <p className={styles.title}>Опрошенных пользовались микрокредитами</p>
          <p>
            Не могли покрыть внезапные траты свыше 7000 ₽. Доступ к заработанным
            деньгам помогает отказаться от кредитов и экономить деньги на
            процентах и штрафах Не могли покрыть внезапные траты свыше 7000 ₽.
            Доступ к заработанным деньгам помогает отказаться от кредитов и
            экономить деньги на процентах и штрафах
          </p>
        </div>
        <div className={styles.info}>
          <p className={styles.title}>Опрошенных пользовались микрокредитами</p>
          <p>
            Не могли покрыть внезапные траты свыше 7000 ₽. Доступ к заработанным
            деньгам помогает отказаться от кредитов и экономить деньги на
            процентах и штрафах Не могли покрыть внезапные траты свыше 7000 ₽.
            Доступ к заработанным деньгам помогает отказаться от кредитов и
            экономить деньги на процентах и штрафахНе могли покрыть внезапные
            траты свыше 7000 ₽. Доступ к заработанным деньгам помогает
            отказаться от кредитов и экономить деньги на процентах и штрафах
          </p>
        </div>
        <div className={styles.info}>
          <p className={styles.title}>Опрошенных пользовались микрокредитами</p>
          <p>
            Не могли покрыть внезапные траты свыше 7000 ₽. Доступ к заработанным
            деньгам помогает отказаться от кредитов и экономить деньги на
            процентах и штрафах Не могли покрыть внезапные траты свыше 7000 ₽.
            Доступ к заработанным деньгам помогает отказаться от кредитов и
            экономить деньги на процентах и штрафахНе могли покрыть внезапные
            траты свыше 7000 ₽. Доступ к заработанным деньгам помогает
            отказаться от кредитов и экономить деньги на процентах и штрафах
          </p>
        </div>
        <div className={styles.info}>
          <p className={styles.title}>Опрошенных пользовались микрокредитами</p>
          <p>
            Не могли покрыть внезапные траты свыше 7000 ₽. Доступ к заработанным
            деньгам помогает отказаться от кредитов и экономить деньги на
            процентах и штрафах Не могли покрыть внезапные траты свыше 7000 ₽.
            Доступ к заработанным деньгам помогает отказаться от кредитов и
            экономить деньги на процентах и штрафах
          </p>
        </div>
      </div>
    </div>
  );
});
